Repository: sewpalu/ProGramm
Catalog: i18n/*/pro_gramm.po
Languages: de

source: Nonterminal
de: Nichtterminal

source: A Terminal cannot be a start symbol!
de: Ein Terminal kann kein Startsymbol sein!

source: Please select the type of symbol! Input '
de: Bitte wählen Sie die Symbolart! Input '

source: ' is invalid.
de: ' ist ungültig.

source: The symbol value must not be empty!
de: Der Symbolwert kann nicht leer sein!

source: There already exists a symbol with the value '
de: Es gibt bereits ein Symbol mit dem Wert '

source: Select one or multiple symbols to delete them.
de: Bitte wählen Sie ein oder mehrere Symbole zum löschen.

source: Save!
de: Speichern!

source: Reset!
de: Zurücksetzen!

source: Input (grammar, word)
de: Eingabe (Grammatik, Wort)

source: CNF check
de: CNF Prüfung

source: Syntax tree
de: Ableitungsbaum

source: Input grammar or input word not set
de: Eingabegrammatik oder Eingabewort sind nicht gesetzt

source: <b>Grammar plausibility check failed</b> <i>Reason</i>
de: <b>Plausibilitätsprüfung der Grammatik ist fehlgeschlagen!</b> <i>Grund</i>

source: <b>Grammar is not in CNF</b> <i>Reason</i>
de: <b>Grammatik ist nicht in CNF!</b> <i>Grund!</i>

source: <b>CYK algorithm failed</b> <i>Reason</i>
de: <b>CYK Algorithmus is fehlgeschlagen!</b> <i>Grund</i>

source: For this combination of grammar and test word, an increased execution time might occur. Do you want to proceed?
de: Für dieses Eingabewort kann eine erhöhte Ausführungszeit auftreten. Möchten Sie fortfahren?

source: Warning!
de: Warnung!

source: Please enter a valid grammar name!
de: Bitte geben Sie einen gültigen Namen für die Grammatik ein!

source: The grammar with the name '
de: Die Grammatik mit dem Namen '

source: ' already exists. Do you wish to override it?
de: ' existiert bereits. Möchten Sie sie überschreiben?

source: Confirmation
de: Bestätigung

source: A grammar has to be selected to load it!
de: Zum Laden muss eine Grammatik ausgewählt werden!

source: Exactly on grammar has to be selected to load it!
de: Genau eine Grammatik muss ausgewählt werden um sie zu laden!

source: Please select a symbol for the left side of the production!
de: Bitte wählen Sie ein Symbol für die linke Seite der Produktionsregel!

source: The symbol '%s' is not in the alphabet. Please add it to use it.
de: Das symbol '%s' ist nicht Teil des Alphabets. Bitte fügen Sie es hinzu, um es zu benutzen.

source: A symbol has to be selected for each position. Alternatively the amount of symbols to the right of the production can be reduced.
de: Für jede Position muss ein Symbol gewählt werden. Alternativ kann die Anahl der Symbole auf der rechten Seite der Produktionsregel reduziert werden.

source: Visualisation
de: Visualisierung

source: <b>No diagnostics</b> <i>Reason</i> All good * hi
de: <b>CYK Algorithmus is fehlgeschlagen!</b> <i>Grund</i> Keiner * Test

source: Previous
de: Zurück

source: Next
de: Weiter

source: Productions
de: Produktionen

source: Overview
de: Überblick

source: Settings
de: Einstellungen

source: Activate grammar!
de: Grammatik aktivieren!

source: Add symbol:
de: Symbol hinzufügen:

source: Is startsymbol
de: Startsymbol

source: Add symbol!
de: Symbol hizufügen!

source: Nonterminals
de: Nichtterminal

source: Terminals
de: Terminal

source: Delete symbols!
de: Symbole löschen!

source: produces
de: produziert

source: Add production!
de: Produktion hinzufügen!

source: Delete production!
de: Produktion löschen!

source: Check grammar!
de: Grammatik prüfen!

source: Save grammar!
de: Grammatik speichern!

source: Load
de: Laden

source: Delete
de: Löschen

source: Alternatives
de: Alternativen

source: Input word
de: Eingabewort
